/* Title for add variable button in blocks menu. */
"+ Add Variable" = "+ Add Variable";

/* Title for add new object button on objects bar. */
"Add" = "Add";

/* Section header in media selection view. */
"All Looks" = "All Looks";

/* Section header in media selection view. */
"All Sounds" = "All Sounds";

/* BLE device not suppored. */
"BLE-device-not-support" = "The %@ is only supported on newer iPad models because it requires Bluetooth 4.0 (BLE).";

/* Character info page title */
"Characters" = "Characters";

/* Device connection status */
"Connected" = "Connected";

/* Title for create new variable button */
"Create" = "Create";

/* Title for delete button */
"DELETE" = "DELETE";

/* Delete character dailog message */
"Delete this character?" = "Delete this character?";

/* Delete device dailog message */
"Delete this device?" = "Delete this device?";

/* Device info page title */
"Devices" = "Devices";

/* Device connection status */
"Disconnect" = "Disconnect";

/* Device connection status */
"Disconnected" = "Disconnected";

/* Faild to add a new character error message */
"error-character-added-failed-description" = "Unable to add the character.";

/* Device connection faild default error message */
"error-connection-failed-description" = "Try restarting the device by removing and re-installing its battery.";

/* Device connection faild default error message title */
"error-connection-failed-title" = "Connection Failed";

/* Already  add the same device error message. (Should include a %@, which will be replace by device name) */
"error-device-already-added-description" = "You have already added a %@";

/* Download media failed */
"error-download-media-failed" = "Unable to download this media.\nPlease try again later.";

/* Object has same name error message */
"error-object-has-same-name-description" = "There is a sprite already has a same name";

/* Finish quick tutorial dialog description */
"finish-tutorial-description" = "Let's discover more projects.";

/* Finish quick tutorial dialog title */
"finish-tutorial-title" = "Nicely done!";

/* Scope selections for a new variable */
"For all objects" = "For all objects";

/* Scope selections for a new variable */
"For this object" = "For this object";

/* Character hidden setting switch title */
"Hide in player" = "Hide in player";

/* Description for add object hint */
"hint-add-object-description" = "Select a device or a character to add to the current project.";

/* Title for add object hint */
"hint-add-object-title" = "Add Devices and Characters";

/* Title for add variable description */
"hint-add-variable-description" = "Add a variable or a list to the current project. A variable is a changable number or text.";

/* Title for add variable hint */
"hint-add-variable-title" = "Add Variables";

/* Tutorial page title in IDE */
"How To..." = "How To...";

/* Button title for new variable selection menu. */
"List" = "List";

/* General loading place holder */
"Loading ..." = "Loading ...";

/* Multiple BLE device not suppored. */
"multi-BLE-device-not-support" = "The following devices are only supported on newer iPad models because they require Bluetooth 4.0 (BLE):\n\n";

/* Placeholder text for new variable */
"Name" = "Name";

/* Title for create new list page */
"New List" = "New List";

/* Title for create new variable page */
"New Variable" = "New Variable";

/* No available selections */
"No Selections" = "No Selections";

/* Object rename field place holder */
"Object name" = "Object name";

/* Confirm popover dialog */
"OK" = "OK";

/* Header for character selection view in object info page */
"Other Characters" = "Other Characters";

/* Save current changes in IDE to a new project or not */
"project-save-or-discard" = "Save as a new project or discard all changes.";

/* Quick tutorial description */
"quick-tutorial-description" = "The following animation will show you how to build a script. Then press the Play button to try it.";

/* Quick tutorial title */
"quick-tutorial-title" = "Quick Tutorial";

/* Section header in media selection view. */
"Related Looks" = "Related Looks";

/* Section header in media selection view. */
"Related Sounds" = "Related Sounds";

/* Title of saving to new document  */
"Save your changes?" = "Save your changes?";

/* Scanning devices default description */
"Searching for devices nearby." = "Searching for devices nearby.";

/* Hint for device connection view */
"Tap to connect..." = "Tap to connect...";

/* Button title for new variable selection menu. */
"Variable" = "Variable";

